app/views/item/index.html.erb

    <% @items.each do |item| %>
    <% item_attachments = item.item_attachments.all %>
---
SELECT "item_attachments".* FROM "item_attachments" WHERE "item_attachments"."item_id" = $1  [["item_id", 1]]
SELECT "items".* FROM "items"