app/views/shops/show.html.erb

SELECT "shops".* FROM "shops" INNER JOIN "shops_users" ON "shops"."id" = "shops_users"."shop_id" WHERE "shops_users"."user_id" = $1 AND "shops"."id" = $2  [["user_id", 2], ["id", 1]]
---
    <!-- Check if user does not own this shop -->
    <% if !current_user.shops.include?(@shop)%>

SELECT  "item_attachments".* FROM "item_attachments" WHERE "item_attachments"."item_id" = $1  ORDER BY "item_attachments"."id" ASC LIMIT 1  [["item_id", 1]]
SELECT "items".* FROM "items" WHERE "items"."shop_id" = $1  [["shop_id", 1]]
---
      <% @item.each do |item| %>
          <% if item.item_attachments.first %>