app/views/home/index.html.erb

SELECT  "item_attachments".* FROM "item_attachments" WHERE "item_attachments"."item_id" = $1  ORDER BY "item_attachments"."id" ASC LIMIT 1  [["item_id", 8]]
SELECT "items".* FROM "items"
---
      <ul class="gallery_o">
        <% if item.item_attachments.first %>