app/views/carts/index.html.erb

SELECT  1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = $1 LIMIT 1  [["cart_id", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1  ORDER BY created_at ASC  [["cart_id", 1]]
---
<body>
<%if @cart.cart_items.empty?%> <!--checks if the cart is empty-->

SELECT  "item_attachments".* FROM "item_attachments" WHERE "item_attachments"."item_id" = $1  ORDER BY "item_attachments"."id" ASC LIMIT 1  [["item_id", 8]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 8]]
---

		<%if cart_item.item.item_attachments.first %>