app/controllers/cart_items_controller.rb

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."item_id" = 8  ORDER BY created_at ASC LIMIT 1  [["cart_id", 2]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]
---
	def create
		if (current_user) # check if a user is logged in
			cart = current_cart
			item = Item.find(params[:item_id])

DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 1]]
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 2]]
---
	def destroy
		CartItem.destroy(params[:cart_item_id])

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."id" = $2  ORDER BY created_at ASC LIMIT 1  [["cart_id", 1], ["id", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]
---
	def update_quantity
		cart = current_cart
		cart_item = cart.cart_items.find(params[:cart_item_id])