app/controllers/cart_items_controller.rb

	def create
		@cart = current_cart
		item = Item.find(params[:item_id])
		@cart_item = @cart.cart_items.new(item: item)
		if @cart_item.save
---
INSERT INTO "cart_items" ("item_id", "cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["item_id", 8], ["cart_id", 2], ["created_at", "2015-05-01 19:50:29.773217"], ["updated_at", "2015-05-01 19:50:29.773217"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-05-01 19:50:29.728469"], ["updated_at", "2015-05-01 19:50:29.728469"]]