app/controllers/item_attachments_controller.rb

SELECT "item_attachments".* FROM "item_attachments"
---
  def index
    @item_attachments = ItemAttachment.all