app/controllers/item_controller.rb

SELECT "item_attachments".* FROM "item_attachments" WHERE "item_attachments"."item_id" = $1  [["item_id", 8]]
---
  def edit
    #finding certain item using id to edit
  	@item = Item.find(params[:id])
    @item_attachments = @item.item_attachments.all