app/controllers/item_controller.rb

SELECT "items".* FROM "items"
---
  def index
    #Creating an array of all items
  	@items = Item.all

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "item_attachments".* FROM "item_attachments" WHERE "item_attachments"."item_id" = $1  [["item_id", 1]]
---
  def show
    #finding certain Item using id to use in show page
    @item = Item.find(params[:id])
    @item_attachments = @item.item_attachments.all

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 8]]
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT 1  [["id", 4]]
---
  def edit
    #finding certain item using id to edit
  	@item = Item.find(params[:id])
    #@item_attachments = @item.item_attachments.all
    @shop = Shop.find(params[:shop_id])

INSERT INTO "item_reports" ("user_id", "item_id") VALUES ($1, $2) RETURNING "user_id"  [["user_id", 2], ["item_id", 1]]
SELECT COUNT(1) FROM "item_reports"
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "item_reports".* FROM "item_reports" WHERE "item_reports"."item_id" = $1 AND "item_reports"."user_id" = $2 LIMIT 1  [["item_id", 3], ["user_id", 1]]
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 1]]
UPDATE "users" SET "reports" = $1, "banned" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["reports", 1], ["banned", "t"], ["updated_at", "2015-04-30 17:10:21.828697"], ["id", 4]]
---
  def report
    # report the item
    ItemReport.create(user_id:current_user.id,item_id:params[:id])
    flash[:notice] = "Item Reported Successfully"
    if (ItemReport.count(params[:id]) >= 3) # count number of reports for a given item
      #delete Item
      flash[:notice] = "Item Is now DELETED , thank you for the feedback"
      item = Item.find(params[:id])
      #add to user reports 1
      user = User.find(item.shop.user.id)
      item.destroy
      reports = user.reports + 1
      user.update_without_password(reports: reports)

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 8]]
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT 1  [["id", 4]]
SELECT "shops".* FROM "shops" WHERE "shops"."user_id" = $1 AND "shops"."id" = $2  [["user_id", 215], ["id", 4]]
UPDATE "items" SET "item_name" = $1, "price" = $2, "updated_at" = $3 WHERE "items"."id" = $4  [["item_name", "New Item Name"], ["price", "20005.0"], ["updated_at", "2015-04-30 12:15:21.170435"], ["id", 1]]
SELECT "item_attachments".* FROM "item_attachments" WHERE "item_attachments"."item_id" = $1  [["item_id", 1]]
INSERT INTO "item_attachments" ("photo", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["photo", "10981659_10155328141435626_1807633580489402981_n.jpg"], ["item_id", 1], ["created_at", "2015-04-30 14:38:08.186300"], ["updated_at", "2015-04-30 14:38:08.186300"]]
---
  def update
    #Find an existing item using form parameters
  	@item = Item.find(params[:id])
    @shop = Shop.find(params[:shop_id])
    #Update the item
    if current_user.shops.include?(@shop)
  	 if @item.update_attributes(item_params)
      if params[:item_attachments]
        params[:item_attachments]['photo'].each do |a|
          @item_attachment = @item.item_attachments.create!(:photo => a, :item_id => @item.id)

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    #Instantiate a new Item with default values
  	@item = Item.new
    @item_attachment = @item.item_attachments.build
    @shop = Shop.find(params[:shop_id])

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "items" ("item_name", "price", "description", "inspiration", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["item_name", "test"], ["price", "25.0"], ["description", "test1"], ["inspiration", "test2"], ["created_at", "2015-04-30 14:27:43.371203"], ["updated_at", "2015-04-30 14:27:43.371203"]]
INSERT INTO "item_attachments" ("photo", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["photo", "background.jpg"], ["item_id", 1], ["created_at", "2015-04-30 14:27:43.407276"], ["updated_at", "2015-04-30 14:27:43.407276"]]
---
  def create
    #Instantiate a new Item using form parameters
  	@item = Item.new(item_params)
    @item.category = params[:category]
    @shop = Shop.find(params[:shop_id])
    #Save the item

    if @item.save
      if params[:item_attachments]
        params[:item_attachments]['photo'].each do |a|
          @item_attachment = @item.item_attachments.create!(:photo => a, :item_id => @item.id)

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 8]]
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT 1  [["id", 4]]
---
  def delete
    #finding certain item using id to delete
    @item = Item.find(params[:id])
    @shop = Shop.find(params[:shop_id])

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT 1  [["id", 4]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 8]]
SELECT "shops".* FROM "shops" WHERE "shops"."user_id" = $1 AND "shops"."id" = $2  [["user_id", 215], ["id", 4]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 8]]
---
  def destroy
    @shop = Shop.find(params[:shop_id])
    @item = Item.find(params[:id])
    if current_user.shops.include?(@shop)
      @item.destroy

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "item_attachments".* FROM "item_attachments" WHERE "item_attachments"."item_id" = $1 AND "item_attachments"."id" = $2 LIMIT 1  [["item_id", 1], ["id", 1]]
DELETE FROM "item_attachments" WHERE "item_attachments"."id" = $1  [["id", 1]]
---
  def destroyImage
    @item = Item.find(params[:id])
    image = @item.item_attachments.all.find(params[:attachment_id])
    image.destroy