app/controllers/messages_controller.rb

  def create

    @recipient = User.find_by(uname: params[:new_message][:runame])
---
SELECT  "users".* FROM "users" WHERE "users"."uname" = $1 LIMIT 1  [["uname", "omar2"]]