app/controllers/sessions_controller.rb

def login #logs in the user
user = User.find_by(uname: params[:session][:uname]) #checks if the user name provided by user exists in db
---
SELECT  "users".* FROM "users" WHERE "users"."uname" = $1 LIMIT 1  [["uname", "user name"]]

def create #creates a new user from the values passed to signup hash and stores it in the db and redirects the user to the home page if successful else refresh the signup page
@user = User.new(user_params)
	if (@user.save) #check if user insertion was done correctly
---
INSERT INTO "users" ("uname", "password_digest", "fname", "lname", "email", "phone", "activation_digest") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "user_id"