app/controllers/shops_controller.rb

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "items".* FROM "items" WHERE "items"."shop_id" = $1  [["shop_id", 1]]
---
  def show
  	@shop = Shop.find(params[:id])
    @item = @shop.items
# Client.where("orders_count = ? AND locked = ?", params[:orders], false)
@categoryOne = @item.where("category = ")

INSERT INTO "shops" ("shop_name", "shop_desc", "cover", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["shop_name", "default"], ["shop_desc", "test"], ["cover", "background.jpg"], ["user_id", 1], ["created_at", "2015-04-30 14:27:22.825310"], ["updated_at", "2015-04-30 14:27:22.825310"]]
---
  def create
    # Instantiate a new object - shop_params is a private methode
    @shop = Shop.new(shop_params)
    @user = current_user
    @shop.user = @user
    # Save
    if @shop.save

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "shops".* FROM "shops" WHERE "shops"."user_id" = $1 AND "shops"."id" = $2  [["user_id", 1], ["id", 1]]
---
  def delete
    # Check if user already owns the shop inorder to delete it
    @shop = Shop.find(params[:id])
    if current_user.shops.include?(@shop)

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "shops".* FROM "shops" WHERE "shops"."user_id" = $1 AND "shops"."id" = $2  [["user_id", 1], ["id", 1]]
DELETE FROM "shops" WHERE "shops"."id" = $1  [["id", 1]]
SELECT "items".* FROM "items" WHERE "items"."shop_id" = $1  [["shop_id", 1]]
---
  def destroy
    # Find an existing object and destroy it
    shop = Shop.find(params[:id])
    if current_user.shops.include?(shop)
    	shop.destroy
    	item = shop.items
    	item.each do |item|